In [1]:
import pandas as pd

In [2]:
raw_data = {'Bank CID':['1','2','3','4','5'],
           'F_Name':['Riya','Alex','Will','Mark','Allen'],
           'L_Name':['Rob','Job','George','Mitch','Steve']}
raw_data

{'Bank CID': ['1', '2', '3', '4', '5'],
 'F_Name': ['Riya', 'Alex', 'Will', 'Mark', 'Allen'],
 'L_Name': ['Rob', 'Job', 'George', 'Mitch', 'Steve']}

In [3]:
bank1_df = pd.DataFrame(raw_data,columns=['Bank CID','F_Name','L_Name'])
bank1_df

  Bank CID F_Name  L_Name
0        1   Riya     Rob
1        2   Alex     Job
2        3   Will  George
3        4   Mark   Mitch
4        5  Allen   Steve

In [4]:
raw_data = {'Bank CID':['6','7','8','9','10'],
           'F_Name':['Bill','Sara','Seth','Holly','Sarah'],
           'L_Name':['Christian','Mo','Bob','Steve','Heather']}
bank2_df = pd.DataFrame(raw_data,columns=['Bank CID','F_Name','L_Name'])
bank2_df

  Bank CID F_Name     L_Name
0        6   Bill  Christian
1        7   Sara         Mo
2        8   Seth        Bob
3        9  Holly      Steve
4       10  Sarah    Heather

In [5]:
bank_all_df = pd.concat([bank1_df,bank2_df]) #index repeats
bank_all_df

  Bank CID F_Name     L_Name
0        1   Riya        Rob
1        2   Alex        Job
2        3   Will     George
3        4   Mark      Mitch
4        5  Allen      Steve
0        6   Bill  Christian
1        7   Sara         Mo
2        8   Seth        Bob
3        9  Holly      Steve
4       10  Sarah    Heather

In [6]:
bank_all_df = pd.concat([bank1_df,bank2_df], ignore_index=True) #index set to continuos 
bank_all_df

  Bank CID F_Name     L_Name
0        1   Riya        Rob
1        2   Alex        Job
2        3   Will     George
3        4   Mark      Mitch
4        5  Allen      Steve
5        6   Bill  Christian
6        7   Sara         Mo
7        8   Seth        Bob
8        9  Holly      Steve
9       10  Sarah    Heather

In [7]:
len(bank_all_df)

10

In [11]:
raw_data = {'Bank CID':['11','12'],
           'F_Name':['Justin','Sophie'],
           'L_Name':['Trudeau','Trudeau']}
bank3_df = pd.DataFrame(raw_data,columns = ['Bank CID','F_Name','L_Name'])
bank3_df

  Bank CID  F_Name   L_Name
0       11  Justin  Trudeau
1       12  Sophie  Trudeau

In [12]:
bank_all_df = pd.concat([bank_all_df,bank3_df],ignore_index=True)
bank_all_df

   Bank CID  F_Name     L_Name
0         1    Riya        Rob
1         2    Alex        Job
2         3    Will     George
3         4    Mark      Mitch
4         5   Allen      Steve
5         6    Bill  Christian
6         7    Sara         Mo
7         8    Seth        Bob
8         9   Holly      Steve
9        10   Sarah    Heather
10       11  Justin    Trudeau
11       12  Sophie    Trudeau

In [13]:
bank1_df

  Bank CID F_Name  L_Name
0        1   Riya     Rob
1        2   Alex     Job
2        3   Will  George
3        4   Mark   Mitch
4        5  Allen   Steve

In [14]:
bank2_df

  Bank CID F_Name     L_Name
0        6   Bill  Christian
1        7   Sara         Mo
2        8   Seth        Bob
3        9  Holly      Steve
4       10  Sarah    Heather

In [15]:
bank_all_df = pd.concat([bank1_df,bank2_df],keys=['Customers Group 1','Customers Group 2']) #multiindexing
bank_all_df

                    Bank CID F_Name     L_Name
Customers Group 1 0        1   Riya        Rob
                  1        2   Alex        Job
                  2        3   Will     George
                  3        4   Mark      Mitch
                  4        5  Allen      Steve
Customers Group 2 0        6   Bill  Christian
                  1        7   Sara         Mo
                  2        8   Seth        Bob
                  3        9  Holly      Steve
                  4       10  Sarah    Heather

In [16]:
bank_all_df.loc[('Customers Group 1'), :]

  Bank CID F_Name  L_Name
0        1   Riya     Rob
1        2   Alex     Job
2        3   Will  George
3        4   Mark   Mitch
4        5  Allen   Steve

In [17]:
bank_all_df.loc[('Customers Group 1'),0]

Bank CID       1
F_Name      Riya
L_Name       Rob
Name: (Customers Group 1, 0), dtype: object

In [18]:
bank_all_df.loc[('Customers Group 2'),'F_Name']

0     Bill
1     Sara
2     Seth
3    Holly
4    Sarah
Name: F_Name, dtype: object

In [19]:
bank_all_df = pd.concat([bank1_df,bank2_df,bank3_df],keys=['Customers Group 1','Customers Group 2','Customers Group 3'])
bank_all_df

                    Bank CID  F_Name     L_Name
Customers Group 1 0        1    Riya        Rob
                  1        2    Alex        Job
                  2        3    Will     George
                  3        4    Mark      Mitch
                  4        5   Allen      Steve
Customers Group 2 0        6    Bill  Christian
                  1        7    Sara         Mo
                  2        8    Seth        Bob
                  3        9   Holly      Steve
                  4       10   Sarah    Heather
Customers Group 3 0       11  Justin    Trudeau
                  1       12  Sophie    Trudeau

In [21]:
bank_all_df.loc[('Customers Group 3'), :]

  Bank CID  F_Name   L_Name
0       11  Justin  Trudeau
1       12  Sophie  Trudeau

In [22]:
bank_all_df = pd.concat([bank1_df,bank2_df],ignore_index=True)
bank_all_df

  Bank CID F_Name     L_Name
0        1   Riya        Rob
1        2   Alex        Job
2        3   Will     George
3        4   Mark      Mitch
4        5  Allen      Steve
5        6   Bill  Christian
6        7   Sara         Mo
7        8   Seth        Bob
8        9  Holly      Steve
9       10  Sarah    Heather

In [41]:
raw_data = {'Bank CID':['1','2','3','4','5','6','7','8','9','10'],
           'Annual Salary [Rs/year]':[800000,900000,750000,1000000,2500000,600000,2200000,4000000,740000,650000]}
raw_data  #merging
bank_salary_df = pd.DataFrame(raw_data,columns = ['Bank CID','Annual Salary [Rs/year]'])
bank_salary_df

  Bank CID  Annual Salary [Rs/year]
0        1                   800000
1        2                   900000
2        3                   750000
3        4                  1000000
4        5                  2500000
5        6                   600000
6        7                  2200000
7        8                  4000000
8        9                   740000
9       10                   650000

In [42]:
bank_all_df = pd.merge(bank_all_df,bank_salary_df,on='Bank CID')
bank_all_df

,Bank CID,F_Name,L_Name,Annual Salary [Rs/year]_x,Credit Card Debt_x,Age_x,Credit Card Debt_y,Age_y,Credit Card Debt,Age,Annual Salary [Rs/year]_y,Annual Salary [Rs/year]
0,1,Riya,Rob,800000,80000,22,80000,22,80000,22,800000,800000
1,2,Alex,Job,900000,90000,30,90000,30,90000,30,900000,900000
2,3,Will,George,750000,75000,35,75000,35,75000,35,750000,750000
3,4,Mark,Mitch,1000000,100000,50,100000,50,100000,50,1000000,1000000
4,5,Allen,Steve,2500000,250000,44,250000,44,250000,44,2500000,2500000
5,6,Bill,Christian,600000,0,35,0,35,0,35,600000,600000
6,7,Sara,Mo,2200000,220000,28,220000,28,220000,28,2200000,2200000
7,8,Seth,Bob,4000000,400000,27,400000,27,400000,27,4000000,4000000
8,9,Holly,Steve,740000,74000,27,74000,27,74000,27,740000,740000

In [51]:
bank_all_df.drop(labels =['Credit Card Debt_x','Annual Salary [Rs/year]_x','Age_x','Credit Card Debt_y','Age_y','Annual Salary [Rs/year]_y'],axis=1)

  Bank CID F_Name     L_Name  Credit Card Debt  Age  Annual Salary [Rs/year]
0        1   Riya        Rob             80000   22                   800000
1        2   Alex        Job             90000   30                   900000
2        3   Will     George             75000   35                   750000
3        4   Mark      Mitch            100000   50                  1000000
4        5  Allen      Steve            250000   44                  2500000
5        6   Bill  Christian                 0   35                   600000
6        7   Sara         Mo            220000   28                  2200000
7        8   Seth        Bob            400000   27                  4000000
8        9  Holly      Steve             74000   27                   740000